ExprovipFuel/src/DataProcessors/РеестрФактур/РеестрФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РеестрФактур</name>
</mdclass:DataProcessor>

ExprovipFuel/src/InformationRegisters/НомераФактур/НомераФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераФактур</name>
  <resources>
    <name>НомерФактуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Фактура</name>
    <type>
      <types>DocumentRef.Фактура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/Documents/Фактура/Фактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Фактура</name>
  <registerRecords>AccumulationRegister.ОборотыТоплива</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоставщики</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыКлиенты</registerRecords>
  <attributes>
    <name>ПоследнийНомерПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>флагСчитатьСкидкуОтМестаТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикДороги</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транзакции</name>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>CatalogRef.Карточки</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоТранзакции</name>
      <type>
        <types>CatalogRef.МестаТранзакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦенаСНадбавкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ФактураШаблон</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПоставщика</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагНеУчитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримененнаяСкидка</name>
      <type>
        <types>EnumRef.ВидСкидки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/DataProcessors/РеестрФактур/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СформироватьРеестр(Команда)
	СформироватьРеестрНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗапросВыборкаФактур()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период.ДатаОкончания));
	#Область ТекстЗапроса
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФактураТранзакции.Клиент КАК Клиент,
		|	ФактураТранзакции.ЭтапОплаты КАК ЭтапОплаты,
		|	ФактураТранзакции.Валюта КАК Валюта,
		|	СУММА(ФактураТранзакции.Количество) КАК Количество,
		|	СУММА(ФактураТранзакции.Итого) КАК Итого,
		|	ФактураТранзакции.Ссылка КАК ФактураСсылка,
		|	ФактураТранзакции.Ссылка.Дата КАК ДатаФактуры
		|ПОМЕСТИТЬ ВТ_ДанныеТранзакций
		|ИЗ
		|	Документ.Фактура.Транзакции КАК ФактураТранзакции
		|ГДЕ
		|	ФактураТранзакции.Ссылка.Проведен
		|	И ФактураТранзакции.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ФактураТранзакции.Клиент,
		|	ФактураТранзакции.Валюта,
		|	ФактураТранзакции.ЭтапОплаты,
		|	ФактураТранзакции.Ссылка,
		|	ФактураТранзакции.Ссылка.Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Клиент,
		|	ФактураСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеТранзакций.Клиент КАК Клиент,
		|	ВТ_ДанныеТранзакций.ЭтапОплаты КАК ЭтапОплаты,
		|	ВТ_ДанныеТранзакций.Валюта КАК Валюта,
		|	ВТ_ДанныеТранзакций.Количество КАК Количество,
		|	ОКР(ВТ_ДанныеТранзакций.Итого, 0) КАК Итого,
		|	ВТ_ДанныеТранзакций.ФактураСсылка КАК ФактураСсылка,
		|	ВТ_ДанныеТранзакций.ДатаФактуры КАК ДатаФактуры,
		|	ЕСТЬNULL(НомераФактур.НомерФактуры, 0) КАК НомерФактуры
		|ИЗ
		|	ВТ_ДанныеТранзакций КАК ВТ_ДанныеТранзакций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераФактур КАК НомераФактур
		|		ПО ВТ_ДанныеТранзакций.ФактураСсылка = НомераФактур.Фактура
		|			И ВТ_ДанныеТранзакций.Клиент = НомераФактур.Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Валюта,
		|	ВТ_ДанныеТранзакций.Клиент.Наименование,
		|	ЭтапОплаты
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Итого)
		|ПО
		|	Валюта";
	#КонецОбласти	
	Возврат Запрос;	
КонецФункции	

&НаСервере
Процедура СформироватьРеестрНаСервере()
	ТабличныйДокумент.Очистить();
	
	Макет = Обработки.РеестрФактур.ПолучитьМакет("РеестрФактур");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок"); 
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьВалюта = Макет.ПолучитьОбласть("Валюта");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");	
		
		
	ОбластьШапка.Параметры.ДатаНач = Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy;");
	ОбластьШапка.Параметры.ДатаКон = Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy;");
	
	Запрос = ЗапросВыборкаФактур();
	
	//@skip-check new-color
	ЦветФона = Новый Цвет(160, 224, 224);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ОбластьОформления = ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
	ТабличныйДокумент.Область(ОбластьОформления.Верх, 2, ОбластьОформления.Низ, ТабличныйДокумент.ШиринаТаблицы).ЦветФона = ЦветФона;				
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВалюты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Валюта");
	ИтогКоличество = 0;
	Счетчик = 0;

	Пока ВыборкаВалюты.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаВалюты.Выбрать();
		
		ИтогКоличество = ИтогКоличество + ВыборкаВалюты.Количество;
		ЗаполнитьЗначенияСвойств(ОбластьВалюта.Параметры, ВыборкаВалюты);
		ОбластьОформления = ТабличныйДокумент.Вывести(ОбластьВалюта);
		ТабличныйДокумент.Область(
				ОбластьОформления.Верх, 2, ОбластьОформления.Низ, ТабличныйДокумент.ШиринаТаблицы).ЦветФона = ЦветФона;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Счетчик = Счетчик + 1;
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаДетальныеЗаписи);
			ОбластьОформления = ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			Если Счетчик % 2 = 0 Тогда
				ТабличныйДокумент.Область(
						ОбластьОформления.Верх, 2, ОбластьОформления.Низ, ТабличныйДокумент.ШиринаТаблицы).ЦветФона = ЦветФона;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
	ОбластьИтог.Параметры.ИтогКоличество = ИтогКоличество;
	ОбластьИтог.Параметры.ИтогИтог = "";
		
	ОбластьОформления = ТабличныйДокумент.Вывести(ОбластьИтог);
	Если Счетчик % 2 = 0 Тогда
		ТабличныйДокумент.Область(
				ОбластьОформления.Верх, 2, ОбластьОформления.Низ, ТабличныйДокумент.ШиринаТаблицы).ЦветФона = ЦветФона;
	КонецЕсли;	
	
	ТабличныйДокумент.ФиксацияСверху = 10;
	ТабличныйДокумент.АвтоМасштаб = Истина;	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьРеестрНаСайтНаСервере()
	Запрос = ЗапросВыборкаФактур();
	
	ТаблицаФактур = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаФактур", ТаблицаФактур);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаФактур.Клиент КАК Клиент,
	               |	ТаблицаФактур.ЭтапОплаты КАК ЭтапОплаты,
	               |	ТаблицаФактур.Валюта КАК Валюта,
	               |	ТаблицаФактур.Количество КАК Количество,
	               |	ТаблицаФактур.Итого КАК Итого,
	               |	ТаблицаФактур.ДатаФактуры КАК ДатаФактуры,
	               |	ТаблицаФактур.НомерФактуры КАК НомерФактуры
	               |ПОМЕСТИТЬ ВТ_ТаблицаФактур
	               |ИЗ
	               |	&ТаблицаФактур КАК ТаблицаФактур
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаФактур.Клиент КАК Клиент,
	               |	ВТ_ТаблицаФактур.ЭтапОплаты КАК ЭтапОплаты,
	               |	ВТ_ТаблицаФактур.Валюта КАК Валюта,
	               |	ВТ_ТаблицаФактур.Количество КАК Количество,
	               |	ВТ_ТаблицаФактур.Итого КАК Итого,
	               |	ВТ_ТаблицаФактур.ДатаФактуры КАК ДатаФактуры,
	               |	ВТ_ТаблицаФактур.НомерФактуры КАК НомерФактуры,
	               |	Контрагенты.Логин КАК Логин
	               |ИЗ
	               |	ВТ_ТаблицаФактур КАК ВТ_ТаблицаФактур
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО ВТ_ТаблицаФактур.Клиент = Контрагенты.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Клиент,
	               |	ДатаФактуры
	               |ИТОГИ
	               |	МАКСИМУМ(Логин)
	               |ПО
	               |	Клиент";
	
	ВыборкаКлиент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Клиент");
	Счетчик = 0;
	Пока ВыборкаКлиент.Следующий() Цикл
		ТаблицаКлиента = ТаблицаКлиентаШаблон();
		ВыборкаЗаписи = ВыборкаКлиент.Выбрать();
		Пока ВыборкаЗаписи.Следующий() Цикл
			НоваяСтрока = ТаблицаКлиента.Добавить();
			НоваяСтрока.Date = Формат(ВыборкаЗаписи.ДатаФактуры, "ДФ=dd.MM.yy");
			НоваяСтрока.Number = Формат(ВыборкаЗаписи.НомерФактуры, "ЧГ=0");
			НоваяСтрока.Valuta = ВыборкаЗаписи.Валюта;
			НоваяСтрока.Litry = Формат(ВыборкаЗаписи.Количество, "ЧГ=0");;
			НоваяСтрока.Summa = Формат(ВыборкаЗаписи.Итого, "ЧГ=0");;
			НоваяСтрока.FileName = НоваяСтрока.Number
		КонецЦикла;
		Попытка
			ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайла(ВыборкаКлиент.Логин, "invoice\invoicelist", "csv");
			Exprovip.ВыгрузитьТаблицуВCSV(ТаблицаКлиента, ";", ИмяФайлаВыгрузки);
			
			Счетчик = Счетчик + 1;
		Исключение
			Сообщение = СтрШаблон("Ошибка выгрузки %1. Ошибка: %2", ВыборкаКлиент.Клиент, ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
		КонецПопытки;
	КонецЦикла;
	
	Если Счетчик > 0 Тогда
		Сообщение = СтрШаблон("Выгружено успешно: %1 клиентов", Счетчик);
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
	КонецЕсли;
КонецПроцедуры

Функция ТаблицаКлиентаШаблон()
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Date");
	ТаблицаЗначений.Колонки.Добавить("Number");
	ТаблицаЗначений.Колонки.Добавить("Valuta");
	ТаблицаЗначений.Колонки.Добавить("Litry");
	ТаблицаЗначений.Колонки.Добавить("Summa");
	ТаблицаЗначений.Колонки.Добавить("FileName");
	
	Возврат ТаблицаЗначений;
КонецФункции	

&НаКлиенте
Процедура ВыгрузитьРеестрНаСайт(Команда)
	ВыгрузитьРеестрНаСайтНаСервере();
КонецПроцедуры
#КонецОбласти
